Repository: SalahFathy25/SpeakerApp
Catalog: lib/app/localization/l10n/intl_*.arb
Languages: ar

source: English
ar: الإنجليزية

# splashTitle
source: Your Personal language Learning tutor
ar: معلم تعلم اللغة الشخصي الخاص بك

# splashLoading
source: Loading...
ar: جار التحميل...

# splashLoadingTitle
source: Just a second and we'll start the lesson!
ar: انتظر ثانية وسنبدأ الدرس!

# splashQuoteTitle
source: “There is only one good, knowledge, and one evil, ignorance.”
ar: «لا يوجد سوى خير واحد، المعرفة، وشر واحد، الجهل.»

# splashQuoteAuthor
source: — Socrates
ar: — سقراط

# welcomeScreenTitle
source: Learn a language in 3 minute a day
ar: تعلم لغة في 3 دقائق يوميًا

source: Start learning
ar: ابدأ التعلم

# haveAnAccount
source: Already, have an account?
ar: هل لديك حساب بالفعل؟

source: Sign up
ar: تسجيل

# signupTitle
source: Sign up and start learning any language
ar: سجل وابدأ تعلم أي لغة

source: Sign up with Phone Number
ar: سجل باستخدام رقم الهاتف

source: Sign up with Google
ar: سجل باستخدام جوجل

source: Sign up with Apple
ar: سجل باستخدام أبل

# createUserName
source: Create your User Name
ar: أنشئ اسم المستخدم الخاص بك

source: User Name
ar: اسم المستخدم

# userNameHint
source: Create a unique username, you can use numbers from 0 to 9 and underscores and dashes
ar: أنشئ اسم مستخدم فريدًا، يمكنك استخدام الأرقام من 0 إلى 9 وشرطات سفلية وشرطات

source: Create password
ar: أنشئ كلمة المرور

# passwordHint
source: Your password must contain 8 characters, 1 uppercase and 1 number.
ar: يجب أن تحتوي كلمة المرور على 8 أحرف، حرف كبير واحد ورقم واحد.

# chooseLanguageToLearn
source: Choose the language you want to learn
ar: اختر اللغة التي تريد تعلمها

source: Spain
ar: إسبانيا

source: French
ar: الفرنسية

source: Belgian
ar: البلجيكية

source: Turkish
ar: التركية

source: Welcome User!
ar: مرحبًا بك أيها المستخدم!

# userTellAbout
source: Tell us a little about yourself
ar: أخبرنا قليلاً عن نفسك

# dontKnow
source: I don't know {language}
ar: أنا لا أعرف {language}

# alreadyStudy
source: I have already studied {language}
ar: لقد درست {language} بالفعل

# whyChooseLanguage
source: Why are you studying {language}?
ar: لماذا تدرس {language}؟

source: Friend and Family
ar: الأصدقاء والعائلة

# entertainment
source: Entertainment & Culture
ar: الترفيه والثقافة

source: Study
ar: الدراسة

source: Trips
ar: الرحلات

source: Work
ar: العمل

# knowYourLevel
source: Do you already know your level?
ar: هل تعرف مستواك بالفعل؟

# chooseLevel
source: Choose your level
ar: اختر مستواك

# screeningTest
source: Take a screening test
ar: اختبار تحديد المستوى

source: Your Level
ar: مستواك

# beginning
source: A1 - Beginning
ar: A1 - مبتدئ

# elementary
source: A2 - Elementary
ar: A2 - أساسي

# intermediate
source: B1 - Intermediate
ar: B1 - متوسط

# upperIntermediate
source: B1 - Upper intermediate
ar: B1 - فوق المتوسط

# advanced
source: C1 - Advanced
ar: C1 - متقدم

# exercisePerDay
source: How long do you want to exercise per day?
ar: كم من الوقت تريد التمرين يوميًا؟

# exercisePerDayHint
source: For your level, it's recommended to practice 10 minutes a day.
ar: لمستواك، يوصى بممارسة 10 دقائق يوميًا.

# minPerDay
source: min/day
ar: دقيقة/يوم

source: Log in
ar: تسجيل الدخول

# loginTitle
source: Log in and continue your learning
ar: سجل الدخول واستمر في تعلمك

# continueButton
source: Continue
ar: متابعة

source: Log in with Google
ar: سجل الدخول باستخدام جوجل

source: Log in with Apple
ar: سجل الدخول باستخدام أبل

source: Log in with Phone Number
ar: سجل الدخول باستخدام رقم الهاتف

source: or
ar: أو

# privacyPolicy
source: By joining, I declare that I have read and accent the Terms and Privacy Policy
ar: بالانضمام، أقر بأنني قد قرأت شروط الخصوصية وأوافق عليها

# notHaveAnAccount
source: Don't have an account yet?
ar: ليس لديك حساب بعد؟

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور الخاصة بك

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# wrongPassword
source: You entered the wrong password. Try again or click the reset password button.
ar: لقد أدخلت كلمة مرور خاطئة. حاول مرة أخرى أو انقر على زر إعادة تعيين كلمة المرور.

# resetPassword
source: Reset my password
ar: إعادة تعيين كلمة المرور

# startScreenTitle
source: Welcome to your first lessons!
ar: مرحبًا بك في دروسك الأولى!

source: Let's Go!
ar: لنبدأ!
